app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at desc
---
  def index
    @articles = Article.all.order("created_at DESC")

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 21]]
---
  def destroy
    @article = current_user.articles.find(params[:id])
    @article.destroy

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "to ja "], ["text", "tomasz122121"], ["created_at", "2019-03-05 10:53:12.772983"], ["updated_at", "2019-03-05 10:53:12.772983"], ["user_id", 1]]
---
  def create
    @article = current_user.articles.build(article_params)

    if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "kfakfkewqewq"], ["updated_at", "2019-02-19 00:16:41.866933"], ["id", 3]]
---
  def update
    @article = Article.update